Revit 2024 API
ItemFactoryBase Properties
The ItemFactoryBase type exposes the following members.
Properties
Name | Description
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
See Also
ItemFactoryBase Class
Autodesk.Revit.Creation Namespace